name: "RCF"

layer {
  name: "data"
  type: "ImageLabelmapData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: false
    mean_value: 104.00699
    mean_value: 116.66877
    mean_value: 122.67892
  }
  image_data_param {
    root_folder: "../../data"
    source: "../../data/bsds_pascal_train_pair.lst"
    batch_size: 1
    shuffle: true
    new_height: 0
    new_width: 0
  }
}
layer {
  name: "data"
  type: "ImageLabelmapData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    mean_value: 104.00699
    mean_value: 116.66877
    mean_value: 122.67892
  }
  image_data_param {
    root_folder: "../../data/"
    source: "../../data/bsds_pascal_train_pair.lst"
    #Just setup the network. No real online testing
    batch_size: 1
    shuffle: true
    new_height: 0
    new_width: 0
  }
}

layer { name: "conv1_1" type: "Convolution" bottom: "data" top: "conv1_1"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param {   num_output: 64 pad: 1 kernel_size: 3 } }
layer { name: "relu1_1" type: "ReLU" bottom: "conv1_1" top: "conv1_1" }
layer { name: "conv1_2" type: "Convolution" bottom: "conv1_1" top: "conv1_2"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param {   num_output: 64 pad: 1 kernel_size: 3 } }
layer { name: "relu1_2" type: "ReLU" bottom: "conv1_2" top: "conv1_2" }
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1_2"
  top: "pool1"
  top: "pool1_mask"
  pooling_param { pool: MAX kernel_size: 2 stride: 2 }
}

layer { name: "conv2_1" type: "Convolution" bottom: "pool1" top: "conv2_1"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param {   num_output: 128 pad: 1 kernel_size: 3 } }
layer { name: "relu2_1" type: "ReLU" bottom: "conv2_1" top: "conv2_1" }
layer { name: "conv2_2" type: "Convolution" bottom: "conv2_1" top: "conv2_2"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param {   num_output: 128 pad: 1 kernel_size: 3 } }
layer { name: "relu2_2" type: "ReLU" bottom: "conv2_2" top: "conv2_2" }
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2_2"
  top: "pool2"
  top: "pool2_mask"
  pooling_param { pool: MAX kernel_size: 2 stride: 2 }
}

layer { name: "conv3_1" type: "Convolution" bottom: "pool2" top: "conv3_1"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param {   num_output: 256 pad: 1 kernel_size: 3 } }
layer { name: "relu3_1" type: "ReLU" bottom: "conv3_1" top: "conv3_1" }
layer { name: "conv3_2" type: "Convolution" bottom: "conv3_1" top: "conv3_2"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param {   num_output: 256 pad: 1 kernel_size: 3 } }
layer { name: "relu3_2" type: "ReLU" bottom: "conv3_2" top: "conv3_2" }
layer { name: "conv3_3" type: "Convolution" bottom: "conv3_2" top: "conv3_3"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param {   num_output: 256 pad: 1 kernel_size: 3 } }
layer { name: "relu3_3" type: "ReLU" bottom: "conv3_3" top: "conv3_3" }
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv3_3"
  top: "pool3"
  top: "pool3_mask"
  pooling_param { pool: MAX kernel_size: 2 stride: 2 }
}

layer { name: "conv4_1" type: "Convolution" bottom: "pool3" top: "conv4_1"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param {   num_output: 512 pad: 1 kernel_size: 3 } }
layer { name: "relu4_1" type: "ReLU" bottom: "conv4_1" top: "conv4_1" }
layer { name: "conv4_2" type: "Convolution" bottom: "conv4_1" top: "conv4_2"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param {   num_output: 512 pad: 1 kernel_size: 3 } }
layer { name: "relu4_2" type: "ReLU" bottom: "conv4_2" top: "conv4_2" }
layer { name: "conv4_3" type: "Convolution" bottom: "conv4_2" top: "conv4_3"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  convolution_param {   num_output: 512 pad: 1 kernel_size: 3 } }
layer { name: "relu4_3" type: "ReLU" bottom: "conv4_3" top: "conv4_3" }
layer {
  name: "pool4"
  type: "Pooling"
  bottom: "conv4_3"
  top: "pool4"
  pooling_param { pool: MAX kernel_size: 2 stride: 1 }
}

layer { name: "conv5_1" type: "Convolution" bottom: "pool4" top: "conv5_1"
  param { lr_mult: 100 decay_mult: 1 } param { lr_mult: 200 decay_mult: 0 }
  convolution_param { num_output: 512 pad: 2 kernel_size: 3 dilation: 2 } }
layer { name: "relu5_1" type: "ReLU" bottom: "conv5_1" top: "conv5_1" }
layer { name: "conv5_2" type: "Convolution" bottom: "conv5_1" top: "conv5_2"
  param { lr_mult: 100 decay_mult: 1 } param { lr_mult: 200 decay_mult: 0 }
  convolution_param { num_output: 512 pad: 2 kernel_size: 3 dilation: 2 } }
layer { name: "relu5_2" type: "ReLU" bottom: "conv5_2" top: "conv5_2" }
layer { name: "conv5_3" type: "Convolution" bottom: "conv5_2" top: "conv5_3"
  param { lr_mult: 100 decay_mult: 1 } param { lr_mult: 200 decay_mult: 0 }
  convolution_param { num_output: 512 pad: 2 kernel_size: 3 dilation: 2 } }
layer { name: "relu5_3" type: "ReLU" bottom: "conv5_3" top: "conv5_3" }

### conv1 ###
layer { name: "conv1_1_down" type: "Convolution" bottom: "conv1_1" top: "conv1_1_down"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param {   num_output: 21 kernel_size: 1 } }
layer { name: "conv1_2_down" type: "Convolution" bottom: "conv1_2" top: "conv1_2_down"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param {   num_output: 21 kernel_size: 1 } }
layer { name: "score_fuse1" type: "Eltwise" bottom: "conv1_1_down" bottom: "conv1_2_down"
  top: "score_fuse1" eltwise_param { operation: SUM } }
layer { name: "score_dsn1" type: "Convolution" bottom: "score_fuse1" top: "upscore_dsn1"
  param { lr_mult: 0.01 decay_mult: 1 } param { lr_mult: 0.02 decay_mult: 0 }
  convolution_param {   num_output: 1 kernel_size: 1
    weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }
layer { name: "dsn1_loss" type: "SigmoidCrossEntropyLoss" bottom: "upscore_dsn1"
  bottom: "label" top: "dsn1_loss" loss_weight: 1 }

### conv2 ###
layer { name: "conv2_1_down" type: "Convolution" bottom: "conv2_1" top: "conv2_1_down"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param {   num_output: 21 kernel_size: 1 } }
layer { name: "conv2_2_down" type: "Convolution" bottom: "conv2_2" top: "conv2_2_down"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param {   num_output: 21 kernel_size: 1 } }
layer { name: "score_fuse2" type: "Eltwise" bottom: "conv2_1_down" bottom: "conv2_2_down"
  top: "score_fuse2" eltwise_param { operation: SUM } }
layer { name: "score_dsn2" type: "Convolution" bottom: "score_fuse2" top: "score_dsn2"
  param { lr_mult: 0.01 decay_mult: 1 } param { lr_mult: 0.02 decay_mult: 0 }
  convolution_param {   num_output: 1 kernel_size: 1
    weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }
layer { name: "upsample_2" type: "Deconvolution" bottom: "score_dsn2" top: "score_dsn2-up"
  param { lr_mult: 0 decay_mult: 1 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { kernel_size: 4 stride: 2 num_output: 1 } }
layer { name: "crop2" type: "AutoCrop" bottom: "score_dsn2-up" bottom: "data" top: "upscore_dsn2" }
layer { name: "dsn2_loss" type: "SigmoidCrossEntropyLoss" bottom: "upscore_dsn2"
  bottom: "label" top: "dsn2_loss" loss_weight: 1 }

### conv3 ###
layer { name: "conv3_1_down" type: "Convolution" bottom: "conv3_1" top: "conv3_1_down"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param {   num_output: 21 kernel_size: 1 } }
layer { name: "conv3_2_down" type: "Convolution" bottom: "conv3_2" top: "conv3_2_down"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param {   num_output: 21 kernel_size: 1 } }
layer { name: "conv3_3_down" type: "Convolution" bottom: "conv3_3" top: "conv3_3_down"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param {   num_output: 21 kernel_size: 1 } }
layer { name: "score_fuse3" type: "Eltwise" bottom: "conv3_1_down" bottom: "conv3_2_down"
  bottom: "conv3_3_down" top: "score_fuse3" eltwise_param { operation: SUM } }
layer { name: "score_dsn3" type: "Convolution" bottom: "score_fuse3" top: "score_dsn3"
  param { lr_mult: 0.01 decay_mult: 1 } param { lr_mult: 0.02 decay_mult: 0 }
  convolution_param {   num_output: 1 kernel_size: 1
    weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }
layer { name: "upsample_4" type: "Deconvolution" bottom: "score_dsn3" top: "score_dsn3-up"
  param { lr_mult: 0 decay_mult: 1 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { kernel_size: 8 stride: 4 num_output: 1 } }
layer { name: "crop3" type: "AutoCrop" bottom: "score_dsn3-up" bottom: "data" top: "upscore_dsn3" }
layer { name: "dsn3_loss" type: "SigmoidCrossEntropyLoss" bottom: "upscore_dsn3"
  bottom: "label" top: "dsn3_loss" loss_weight: 1 }

### conv4 ###
layer { name: "conv4_1_down" type: "Convolution" bottom: "conv4_1" top: "conv4_1_down"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param {   num_output: 21 kernel_size: 1 } }
layer { name: "conv4_2_down" type: "Convolution" bottom: "conv4_2" top: "conv4_2_down"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param {   num_output: 21 kernel_size: 1 } }
layer { name: "conv4_3_down" type: "Convolution" bottom: "conv4_3" top: "conv4_3_down"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param {   num_output: 21 kernel_size: 1 } }
layer { name: "score_fuse4" type: "Eltwise" bottom: "conv4_1_down" bottom: "conv4_2_down"
  bottom: "conv4_3_down" top: "score_fuse4" eltwise_param { operation: SUM } }
layer { name: "score_dsn4" type: "Convolution" bottom: "score_fuse4" top: "score_dsn4"
  param { lr_mult: 0.01 decay_mult: 1 } param { lr_mult: 0.02 decay_mult: 0 }
  convolution_param {   num_output: 1 kernel_size: 1
    weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }
layer { name: "upsample_8" type: "Deconvolution" bottom: "score_dsn4" top: "score_dsn4-up"
  param { lr_mult: 0 decay_mult: 1 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { kernel_size: 16 stride: 8 num_output: 1 } }
layer { name: "crop4" type: "AutoCrop" bottom: "score_dsn4-up" bottom: "data" top: "upscore_dsn4" }
layer { name: "dsn4_loss" type: "SigmoidCrossEntropyLoss" bottom: "upscore_dsn4"
  bottom: "label" top: "dsn4_loss" loss_weight: 1 }

### conv5 ###
layer { name: "conv5_1_down" type: "Convolution" bottom: "conv5_1" top: "conv5_1_down"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param {   num_output: 21 kernel_size: 1 } }
layer { name: "conv5_2_down" type: "Convolution" bottom: "conv5_2" top: "conv5_2_down"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param {   num_output: 21 kernel_size: 1 } }
layer { name: "conv5_3_down" type: "Convolution" bottom: "conv5_3" top: "conv5_3_down"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param {   num_output: 21 kernel_size: 1 } }
layer { name: "score_fuse5" type: "Eltwise" bottom: "conv5_1_down" bottom: "conv5_2_down"
  bottom: "conv5_3_down" top: "score_fuse5" eltwise_param { operation: SUM } }
layer { name: "score_dsn5" type: "Convolution" bottom: "score_fuse5" top: "score_dsn5"
  param { lr_mult: 0.01 decay_mult: 1 } param { lr_mult: 0.02 decay_mult: 0 }
  convolution_param {   num_output: 1 kernel_size: 1
    weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }
layer { name: "upsample_8_5" type: "Deconvolution" bottom: "score_dsn5" top: "score_dsn5-up"
  param { lr_mult: 0 decay_mult: 1 } param { lr_mult: 0 decay_mult: 0 }
  convolution_param { kernel_size: 16 stride: 8 num_output: 1 } }
layer { name: "crop5" type: "AutoCrop" bottom: "score_dsn5-up" bottom: "data" top: "upscore_dsn5" }
layer { name: "dsn5_loss" type: "SigmoidCrossEntropyLoss" bottom: "upscore_dsn5"
  bottom: "label" top: "dsn5_loss" loss_weight: 1 }

### Concat and multiscale weight layer ###
#layer { name: "concat" bottom: "upscore_dsn1"  bottom: "upscore_dsn2" bottom: "upscore_dsn3"
#  bottom: "upscore_dsn4" bottom: "upscore_dsn5" top: "concat-upscore" type: "Concat"
#  concat_param { concat_dim: 1 } }
#layer { name: 'new-score-weighting' type: "Convolution" bottom: 'concat-upscore' top: 'upscore-fuse'
#  param { lr_mult: 0.001 decay_mult: 1 } param { lr_mult: 0.002 decay_mult: 0 }
#  convolution_param {   num_output: 1 kernel_size: 1
#    weight_filler { type: "constant" value: 0.2 } } }
#layer { name: "fuse_loss" type: "SigmoidCrossEntropyLoss" bottom: "upscore-fuse"
#  bottom: "label" top: "fuse_loss" loss_weight: 1 }


######################
### deconv stage 1 ###
layer {
  name: "deconv5_3"
  type: "Deconvolution"
  bottom: "conv5_3"
  up: "deconv5_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 }
  }
}

layer {
  name: "deconv-bn5_3"
  type: "BatchNorm"
  bottom: "deconv5_3"
  top: "deconv5_3"
}

layer {
  name: "deconv-relu5_3"
  type: "ReLU"
  bottom: "deconv5_3"
  top: "deconv5_3"
}

layer {
  name: "deconv5_2"
  type: "Deconvolution"
  bottom: "deconv5_3"
  up: "deconv5_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 }
  }
}

layer {
  name: "deconv-bn5_2"
  type: "BatchNorm"
  bottom: "deconv5_2"
  top: "deconv5_2"
}

layer {
  name: "deconv-relu5_2"
  type: "ReLU"
  bottom: "deconv5_2"
  top: "deconv5_2"
}

layer {
  name: "deconv5_1"
  type: "Deconvolution"
  bottom: "deconv5_2"
  up: "deconv5_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 }
  }
}

layer {
  name: "deconv-bn5_1"
  type: "BatchNorm"
  bottom: "deconv5_1"
  top: "deconv5_1"
}

layer {
  name: "deconv-relu5_1"
  type: "ReLU"
  bottom: "deconv5_1"
  top: "deconv5_1"
}

### deconv stage 2 ###
layer {    #?????????????????????????????
  name: "unpool4"
  type: "Unpooling"
  bottom: "deconv5_1"
  bottom: "pool4_mask"
  top: "unpool4"
  unpooling_param {
    unpool: MAX
    kernel_size: 2
    stride: 2
    unpool_size: 28
  }
}

layer {
  name: "deconv4_3"
  type: "Deconvolution"
  bottom: "unpool4"
  up: "deconv4_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 }
  }
}

layer {
  name: "deconv-bn4_3"
  type: "BatchNorm"
  bottom: "deconv4_3"
  top: "deconv4_3"
}

layer {
  name: "deconv-relu4_3"
  type: "ReLU"
  bottom: "deconv4_3"
  top: "deconv4_3"
}

layer {
  name: "deconv4_2"
  type: "Deconvolution"
  bottom: "deconv4_3"
  up: "deconv4_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 }
  }
}

layer {
  name: "deconv-bn4_2"
  type: "BatchNorm"
  bottom: "deconv4_2"
  top: "deconv4_2"
}

layer {
  name: "deconv-relu4_2"
  type: "ReLU"
  bottom: "deconv4_2"
  top: "deconv4_2"
}

layer {
  name: "deconv4_1"
  type: "Deconvolution"
  bottom: "deconv4_2"
  up: "deconv4_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 }
  }
}

layer {
  name: "deconv-bn4_1"
  type: "BatchNorm"
  bottom: "deconv4_1"
  top: "deconv4_1"
}

layer {
  name: "deconv-relu4_1"
  type: "ReLU"
  bottom: "deconv4_1"
  top: "deconv4_1"
}

### deconv stage 3 ###
layer {    #?????????????????????????????
  name: "unpool3"
  type: "Unpooling"
  bottom: "deconv4_1"
  bottom: "pool3_mask"
  top: "unpool3"
  unpooling_param {
    unpool: MAX
    kernel_size: 2
    stride: 2
    unpool_size: 56
  }
}

layer {
  name: "deconv3_3"
  type: "Deconvolution"
  bottom: "unpool3"
  up: "deconv3_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 }
  }
}

layer {
  name: "deconv-bn3_3"
  type: "BatchNorm"
  bottom: "deconv3_3"
  top: "deconv3_3"
}

layer {
  name: "deconv-relu3_3"
  type: "ReLU"
  bottom: "deconv3_3"
  top: "deconv3_3"
}

layer {
  name: "deconv3_2"
  type: "Deconvolution"
  bottom: "deconv3_3"
  up: "deconv3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 }
  }
}

layer {
  name: "deconv-bn3_2"
  type: "BatchNorm"
  bottom: "deconv3_2"
  top: "deconv3_2"
}

layer {
  name: "deconv-relu3_2"
  type: "ReLU"
  bottom: "deconv3_2"
  top: "deconv3_2"
}

layer {
  name: "deconv3_1"
  type: "Deconvolution"
  bottom: "deconv3_2"
  up: "deconv3_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 }
  }
}

layer {
  name: "deconv-bn3_1"
  type: "BatchNorm"
  bottom: "deconv3_1"
  top: "deconv3_1"
}

layer {
  name: "deconv-relu3_1"
  type: "ReLU"
  bottom: "deconv3_1"
  top: "deconv3_1"
}

### deconv stage 4 ###
layer {    #?????????????????????????????
  name: "unpool2"
  type: "Unpooling"
  bottom: "deconv3_1"
  bottom: "pool2_mask"
  top: "unpool2"
  unpooling_param {
    unpool: MAX
    kernel_size: 2
    stride: 2
    unpool_size: 112
  }
}

layer {
  name: "deconv2_2"
  type: "Deconvolution"
  bottom: "unpool2"
  up: "deconv2_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 }
  }
}

layer {
  name: "deconv-bn2_2"
  type: "BatchNorm"
  bottom: "deconv2_2"
  top: "deconv2_2"
}

layer {
  name: "deconv-relu2_2"
  type: "ReLU"
  bottom: "deconv2_2"
  top: "deconv2_2"
}

layer {
  name: "deconv2_1"
  type: "Deconvolution"
  bottom: "deconv2_2"
  up: "deconv2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 }
  }
}

layer {
  name: "deconv-bn2_1"
  type: "BatchNorm"
  bottom: "deconv2_1"
  top: "deconv2_1"
}

layer {
  name: "deconv-relu2_1"
  type: "ReLU"
  bottom: "deconv2_1"
  top: "deconv2_1"
}

### deconv stage 5 ###
layer {    #?????????????????????????????
  name: "unpool1"
  type: "Unpooling"
  bottom: "deconv2_1"
  bottom: "pool1_mask"
  top: "unpool1"
  unpooling_param {
    unpool: MAX
    kernel_size: 2
    stride: 2
    unpool_size: 224
  }
}

layer {
  name: "deconv1_2"
  type: "Deconvolution"
  bottom: "unpool1"
  up: "deconv1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 }
  }
}

layer {
  name: "deconv-bn1_2"
  type: "BatchNorm"
  bottom: "deconv1_2"
  top: "deconv1_2"
}

layer {
  name: "deconv-relu1_2"
  type: "ReLU"
  bottom: "deconv1_2"
  top: "deconv1_2"
}

layer {
  name: "deconv1_1"
  type: "Deconvolution"
  bottom: "deconv1_2"
  up: "deconv1_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 }
  }
}

layer {
  name: "deconv-bn1_1"
  type: "BatchNorm"
  bottom: "deconv1_1"
  top: "deconv1_1"
}

layer {
  name: "deconv-relu1_1"
  type: "ReLU"
  bottom: "deconv1_1"
  top: "deconv1_1"
}


